zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba20xx.h
/**
  ******************************************************************************
  * @file    stm32wba20xx.h
  * @author  MCD Application Team
  * @brief   CMSIS STM32WBA20xx Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#ifndef STM32WBA20xx_H
#define STM32WBA20xx_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup ST
  * @{
  */

/** @addtogroup STM32WBA20xx
  * @{
  */

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */
typedef enum
{
/* =======================================  ARM Cortex-M33 Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,    /*!< -15 Reset Vector, invoked on Power up and warm reset              */
  NonMaskableInt_IRQn       = -14,    /*!< -14 Non maskable Interrupt, cannot be stopped or preempted        */
  HardFault_IRQn            = -13,    /*!< -13 Hard Fault, all classes of Fault                              */
  MemoryManagement_IRQn     = -12,    /*!< -12 Memory Management, MPU mismatch, including Access Violation
                                               and No Match                                                  */
  BusFault_IRQn             = -11,    /*!< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                               related Fault                                                 */
  UsageFault_IRQn           = -10,    /*!< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SecureFault_IRQn          =  -9,    /*!< -9  Secure Fault                                                  */
  SVCall_IRQn               =  -5,    /*!< -5  System Service Call via SVC instruction                       */
  DebugMonitor_IRQn         =  -4,    /*!< -4  Debug Monitor                                                 */
  PendSV_IRQn               =  -2,    /*!< -2  Pendable request for system service                           */
  SysTick_IRQn              =  -1,    /*!< -1  System Tick Timer                                             */

/* ===========================================  STM32WBA20xx Specific Interrupt Numbers  ====================================== */
  PVD_IRQn                  = 1,      /*!< PVD through EXTI Line detection Interrupt                         */
  RTC_IRQn                  = 2,      /*!< RTC non-secure interrupt                                          */
  TAMP_IRQn                 = 4,      /*!< Tamper global interrupt                                           */
  RAMCFG_IRQn               = 5,      /*!< RAMCFG global interrupt                                           */
  FLASH_IRQn                = 6,      /*!< FLASH non-secure global interrupt                                 */
  RCC_IRQn                  = 9,      /*!< RCC non secure global interrupt                                   */
  EXTI0_IRQn                = 11,     /*!< EXTI Line0 interrupt                                              */
  EXTI1_IRQn                = 12,     /*!< EXTI Line1 interrupt                                              */
  EXTI2_IRQn                = 13,     /*!< EXTI Line2 interrupt                                              */
  EXTI3_IRQn                = 14,     /*!< EXTI Line3 interrupt                                              */
  EXTI4_IRQn                = 15,     /*!< EXTI Line4 interrupt                                              */
  EXTI5_IRQn                = 16,     /*!< EXTI Line5 interrupt                                              */
  EXTI6_IRQn                = 17,     /*!< EXTI Line6 interrupt                                              */
  EXTI7_IRQn                = 18,     /*!< EXTI Line7 interrupt                                              */
  EXTI8_IRQn                = 19,     /*!< EXTI Line8 interrupt                                              */
  EXTI9_IRQn                = 20,     /*!< EXTI Line9 interrupt                                              */
  EXTI12_IRQn               = 23,     /*!< EXTI Line12 interrupt                                             */
  EXTI13_IRQn               = 24,     /*!< EXTI Line13 interrupt                                             */
  EXTI14_IRQn               = 25,     /*!< EXTI Line14 interrupt                                             */
  EXTI15_IRQn               = 26,     /*!< EXTI Line15 interrupt                                             */
  IWDG_IRQn                 = 27,     /*!< IWDG global interrupt                                             */
  LPDMA1_Channel0_IRQn      = 28,     /*!< LPDMA1 Channel 0 global interrupt                                 */
  LPDMA1_Channel1_IRQn      = 29,     /*!< LPDMA1 Channel 1 global interrupt                                 */
  LPDMA1_Channel2_IRQn      = 30,     /*!< LPDMA1 Channel 2 global interrupt                                 */
  LPDMA1_Channel3_IRQn      = 31,     /*!< LPDMA1 Channel 3 global interrupt                                 */
  LPDMA1_Channel4_IRQn      = 32,     /*!< LPDMA1 Channel 4 global interrupt                                 */
  LPDMA1_Channel5_IRQn      = 33,     /*!< LPDMA1 Channel 5 global interrupt                                 */
  LPDMA1_Channel6_IRQn      = 34,     /*!< LPDMA1 Channel 6 global interrupt                                 */
  LPDMA1_Channel7_IRQn      = 35,     /*!< LPDMA1 Channel 7 global interrupt                                 */
  TIM2_IRQn                 = 40,     /*!< TIM2 global interrupt                                             */
  USART1_IRQn               = 43,     /*!< USART1 global interrupt                                           */
  LPUART1_IRQn              = 44,     /*!< LPUART1 global interrupt                                          */
  LPTIM1_IRQn               = 45,     /*!< LPTIM1 global interrupt                                           */
  TIM16_IRQn                = 47,     /*!< TIM16 global interrupt                                            */
  I2C3_EV_IRQn              = 49,     /*!< I2C3 Event interrupt                                              */
  I2C3_ER_IRQn              = 50,     /*!< I2C3 Error interrupt                                              */
  AES_IRQn                  = 52,     /*!< AES global interrupt                                              */
  RNG_IRQn                  = 53,     /*!< RNG global interrupt                                              */
  FPU_IRQn                  = 54,     /*!< FPU global interrupt                                              */
  HASH_IRQn                 = 55,     /*!< HASH global interrupt                                             */
  PKA_IRQn                  = 56,     /*!< PKA global interrupt                                              */
  SPI3_IRQn                 = 57,     /*!< SPI3 global interrupt                                             */
  ICACHE_IRQn               = 58,     /*!< Instruction cache global interrupt                                */
  ADC4_IRQn                 = 59,     /*!< ADC4 global interrupt                                             */
  RADIO_IRQn                = 60,     /*!< 2.4GHz RADIO global interrupt                                     */
  WKUP_IRQn                 = 61,     /*!< PWR non-secure global WKUP pin interrupt                          */
  RCC_AUDIOSYNC_IRQn        = 63,     /*!< RCC audio synchronization interrupt                               */
} IRQn_Type;


/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */
/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/* --------  Configuration of the STM32WBAxx System On Chip ------ */

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ------ */
#define __CM33_REV                0x0000U   /* Core revision r0p1 */
#define __SAUREGION_PRESENT       1U        /* SAU regions present */
#define __MPU_PRESENT             1U        /* MPU present */
#define __VTOR_PRESENT            1U        /* VTOR present */
#define __NVIC_PRIO_BITS          4U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /* FPU present */
#define __DSP_PRESENT             1U        /* DSP extension present */

/** @} */ /* End of group Configuration_of_CMSIS */

