zephyrproject-rtos/hal_stm32/stm32cube/stm32wbaxx/soc/stm32wba20xx.h
/********************  Bit definition for RCC_ASCR register  **************/
#define RCC_ASCR_CEN_Pos                    (0UL)
#define RCC_ASCR_CEN                        RCC_ASCR_CEN_Msk
#define RCC_ASCR_CEN_Msk                    (0x1UL << RCC_ASCR_CEN_Pos)             /*!< 0x00000001 */
#define RCC_ASCR_PSC_Pos                    (8UL)
#define RCC_ASCR_PSC_Msk                    (0x7FUL << RCC_ASCR_PSC_Pos)            /*!< 0x00007F00 */
#define RCC_ASCR_PSC                        RCC_ASCR_PSC_Msk
#define RCC_ASCR_CPS_Pos                    (16UL)
#define RCC_ASCR_CPS_Msk                    (0x7FUL << RCC_ASCR_CPS_Pos)            /*!< 0x007F0000 */
#define RCC_ASCR_CPS                        RCC_ASCR_CPS_Msk

/********************  Bit definition for RCC_ASIER register  **************/
#define RCC_ASIER_CAIE_Pos                  (0UL)
#define RCC_ASIER_CAIE_Msk                  (0x1UL << RCC_ASIER_CAIE_Pos)           /*!< 0x00000001 */
#define RCC_ASIER_CAIE                      RCC_ASIER_CAIE_Msk
#define RCC_ASIER_COIE_Pos                  (1UL)
#define RCC_ASIER_COIE_Msk                  (0x1UL << RCC_ASIER_COIE_Pos)           /*!< 0x00000002 */
#define RCC_ASIER_COIE                      RCC_ASIER_COIE_Msk
#define RCC_ASIER_CAEIE_Pos                 (2UL)
#define RCC_ASIER_CAEIE_Msk                 (0x1UL << RCC_ASIER_CAEIE_Pos)          /*!< 0x00000004 */
#define RCC_ASIER_CAEIE                      RCC_ASIER_CAEIE_Msk
#define RCC_ASIER_ARIE_Pos                  (3UL)
#define RCC_ASIER_ARIE_Msk                  (0x1UL << RCC_ASIER_ARIE_Pos)           /*!< 0x00000008 */
#define RCC_ASIER_ARIE                      RCC_ASIER_ARIE_Msk                      /*!< ARIE (Auto-reload interrupt enable) */

/********************  Bit definition for RCC_ASSR register  **************/
#define RCC_ASSR_CAF_Pos                    (0UL)
#define RCC_ASSR_CAF_Msk                    (0x1UL << RCC_ASSR_CAF_Pos)             /*!< 0x00000001 */
#define RCC_ASSR_CAF                        RCC_ASSR_CAF_Msk
#define RCC_ASSR_COF_Pos                    (1UL)
#define RCC_ASSR_COF_Msk                    (0x1UL << RCC_ASSR_COF_Pos)             /*!< 0x00000002 */
#define RCC_ASSR_COF                        RCC_ASSR_COF_Msk
#define RCC_ASSR_CAEF_Pos                   (2UL)
#define RCC_ASSR_CAEF_Msk                   (0x1UL << RCC_ASSR_CAEF_Pos)            /*!< 0x00000004 */
#define RCC_ASSR_CAEF                       RCC_ASSR_CAEF_Msk
#define RCC_ASSR_ARF_Pos                    (3UL)
#define RCC_ASSR_ARF_Msk                    (0x1UL << RCC_ASSR_ARF_Pos)             /*!< 0x00000008 */
#define RCC_ASSR_ARF                        RCC_ASSR_ARF_Msk                        /*!< ARF (Auto-reload interrupt flag) */

/********************  Bit definition for RCC_ASCNTR register  **************/
#define RCC_ASCNTR_CNT_Pos                  (0UL)
#define RCC_ASCNTR_CNT_Msk                  (0xFFFFFUL << RCC_ASCNTR_CNT_Pos)       /*!< 0x000FFFFF */
#define RCC_ASCNTR_CNT                      RCC_ASCNTR_CNT_Msk

/********************  Bit definition for RCC_ASARR register  **************/
#define RCC_ASARR_AR_Pos                    (0UL)
#define RCC_ASARR_AR_Msk                    (0xFFFFFUL << RCC_ASARR_AR_Pos)         /*!< 0x000FFFFF */
#define RCC_ASARR_AR                        RCC_ASARR_AR_Msk

/********************  Bit definition for RCC_ASCAR register  **************/
#define RCC_ASCAR_CA_Pos                    (0UL)
#define RCC_ASCAR_CA_Msk                    (0x7FFFFFFUL << RCC_ASCAR_CA_Pos)       /*!< 0x07FFFFFF */
#define RCC_ASCAR_CA                        RCC_ASCAR_CA_Msk

/********************  Bit definition for RCC_ASCOR register  **************/
#define RCC_ASCOR_CO_Pos                    (0UL)
#define RCC_ASCOR_CO_Msk                    (0xFFFFFUL << RCC_ASCOR_CO_Pos)         /*!< 0x000FFFFF */
#define RCC_ASCOR_CO                        RCC_ASCOR_CO_Msk

/********************  Bit definition for RCC_CFGR4 register  *******************/
#define RCC_CFGR4_HPRE5_Pos                 (0UL)
#define RCC_CFGR4_HPRE5_Msk                 (0x7UL << RCC_CFGR4_HPRE5_Pos)          /*!< 0x00000007 */
#define RCC_CFGR4_HPRE5                     RCC_CFGR4_HPRE5_Msk
#define RCC_CFGR4_HPRE5_0                   (0x1UL << RCC_CFGR4_HPRE5_Pos)          /*!< 0x00000001 */
#define RCC_CFGR4_HPRE5_1                   (0x2UL << RCC_CFGR4_HPRE5_Pos)          /*!< 0x00000002 */
#define RCC_CFGR4_HPRE5_2                   (0x4UL << RCC_CFGR4_HPRE5_Pos)          /*!< 0x00000004 */
#define RCC_CFGR4_HDIV5_Pos                 (4UL)
#define RCC_CFGR4_HDIV5_Msk                 (0x1UL << RCC_CFGR4_HDIV5_Pos)          /*!< 0x00000080 */
#define RCC_CFGR4_HDIV5                     RCC_CFGR4_HDIV5_Msk

/********************  Bit definition for RCC_RADIOENR register  **************/
#define RCC_RADIOENR_BBCLKEN_Pos            (1UL)
#define RCC_RADIOENR_BBCLKEN_Msk            (0x1UL << RCC_RADIOENR_BBCLKEN_Pos)      /*!< 0x00000002 */
#define RCC_RADIOENR_BBCLKEN                RCC_RADIOENR_BBCLKEN_Msk
#define RCC_RADIOENR_STRADIOCLKON_Pos       (16UL)
#define RCC_RADIOENR_STRADIOCLKON_Msk       (0x1UL << RCC_RADIOENR_STRADIOCLKON_Pos) /*!< 0x00010000 */
#define RCC_RADIOENR_STRADIOCLKON           RCC_RADIOENR_STRADIOCLKON_Msk
#define RCC_RADIOENR_RADIOCLKRDY_Pos        (17UL)
#define RCC_RADIOENR_RADIOCLKRDY_Msk        (0x1UL << RCC_RADIOENR_RADIOCLKRDY_Pos)  /*!< 0x00020000 */
#define RCC_RADIOENR_RADIOCLKRDY            RCC_RADIOENR_RADIOCLKRDY_Msk

/********************  Bit definition for RCC_ECSCR1 register  *******************/
#define RCC_ECSCR1_HSELDOTRIM_Pos           (8UL)
#define RCC_ECSCR1_HSELDOTRIM_Msk           (0xFU << RCC_ECSCR1_HSELDOTRIM_Pos)      /*!< 0x00000F00 */
#define RCC_ECSCR1_HSELDOTRIM               RCC_ECSCR1_HSELDOTRIM_Msk                /*!< HSE32 LDO voltage level trimming */
#define RCC_ECSCR1_HSELDOSEL_Pos            (14UL)
#define RCC_ECSCR1_HSELDOSEL_Msk            (0x1U << RCC_ECSCR1_HSELDOSEL_Pos)       /*!< 0x00004000 */
#define RCC_ECSCR1_HSELDOSEL                RCC_ECSCR1_HSELDOSEL_Msk                 /*!< HSE32 LDO trim selection */
#define RCC_ECSCR1_XORDYTRIM_Pos            (15UL)
#define RCC_ECSCR1_XORDYTRIM_Msk            (0x1U << RCC_ECSCR1_XORDYTRIM_Pos)       /*!< 0x00008000 */
#define RCC_ECSCR1_XORDYTRIM                RCC_ECSCR1_XORDYTRIM_Msk                 /*!< XO32 clock ready trimming */
#define RCC_ECSCR1_HSETRIM_Pos              (16UL)
#define RCC_ECSCR1_HSETRIM_Msk              (0x3FUL << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x003F0000 */
#define RCC_ECSCR1_HSETRIM                  RCC_ECSCR1_HSETRIM_Msk
#define RCC_ECSCR1_HSETRIM_0                (0x1UL  << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00010000 */
#define RCC_ECSCR1_HSETRIM_1                (0x2UL  << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00020000 */
#define RCC_ECSCR1_HSETRIM_2                (0x4UL  << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00040000 */
#define RCC_ECSCR1_HSETRIM_3                (0x8UL  << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00080000 */
#define RCC_ECSCR1_HSETRIM_4                (0x10UL << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00100000 */
#define RCC_ECSCR1_HSETRIM_5                (0x20UL << RCC_ECSCR1_HSETRIM_Pos)       /*!< 0x00200000 */
#define RCC_ECSCR1_HSEFSEN_Pos              (23UL)
#define RCC_ECSCR1_HSEFSEN_Msk              (0x1U << RCC_ECSCR1_HSEFSEN_Pos)         /*!< 0x00800000 */
#define RCC_ECSCR1_HSEFSEN                  RCC_ECSCR1_HSEFSEN_Msk                   /*!< HSE32 fast startup enable */
#define RCC_ECSCR1_HSERDYTRIM_Pos           (24UL)
#define RCC_ECSCR1_HSERDYTRIM_Msk           (0x7FU << RCC_ECSCR1_HSERDYTRIM_Pos)     /*!< 0x7F000000 */
#define RCC_ECSCR1_HSERDYTRIM               RCC_ECSCR1_HSERDYTRIM_Msk                /*!< HSE32 clock ready trimming */

/*****************  Bit definition for RCC_LSIKEYR register  ******************/
#define RCC_LSIKEYR_KEY_Pos                 (0UL)
#define RCC_LSIKEYR_KEY_Msk                 (0xFFU << RCC_LSIKEYR_KEY_Pos)           /*!< 0x000000FF */
#define RCC_LSIKEYR_KEY                     RCC_LSIKEYR_KEY_Msk                      /*!< LSI1PREDIV write access enable key */


/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos                    (2UL)
#define RNG_CR_RNGEN_Msk                    (0x1UL << RNG_CR_RNGEN_Pos)             /*!< 0x00000004 */
#define RNG_CR_RNGEN                        RNG_CR_RNGEN_Msk                        /*!< True random number generator enable */
#define RNG_CR_IE_Pos                       (3UL)
#define RNG_CR_IE_Msk                       (0x1UL << RNG_CR_IE_Pos)                /*!< 0x00000008 */
#define RNG_CR_IE                           RNG_CR_IE_Msk                           /*!< Interrupt enable */
#define RNG_CR_CED_Pos                      (5UL)
#define RNG_CR_CED_Msk                      (0x1UL << RNG_CR_CED_Pos)               /*!< 0x00000020 */
#define RNG_CR_CED                          RNG_CR_CED_Msk                          /*!< Clock error detection */
#define RNG_CR_ARDIS_Pos                    (7UL)
#define RNG_CR_ARDIS_Msk                    (0x1UL << RNG_CR_ARDIS_Pos)             /*!< 0x00000080 */
#define RNG_CR_ARDIS                        RNG_CR_ARDIS_Msk                        /*!< Auto reset disable */
#define RNG_CR_RNG_CONFIG3_Pos              (8UL)
#define RNG_CR_RNG_CONFIG3_Msk              (0xFUL << RNG_CR_RNG_CONFIG3_Pos)       /*!< 0x00000F00 */
#define RNG_CR_RNG_CONFIG3                  RNG_CR_RNG_CONFIG3_Msk                  /*!< RNG configuration 3 */
#define RNG_CR_NISTC_Pos                    (12UL)
#define RNG_CR_NISTC_Msk                    (0x1UL << RNG_CR_NISTC_Pos)             /*!< 0x00001000 */
#define RNG_CR_NISTC                        RNG_CR_NISTC_Msk                        /*!< NIST custom */
#define RNG_CR_RNG_CONFIG2_Pos              (13UL)
#define RNG_CR_RNG_CONFIG2_Msk              (0x7UL << RNG_CR_RNG_CONFIG2_Pos)       /*!< 0x0000E000 */
#define RNG_CR_RNG_CONFIG2                  RNG_CR_RNG_CONFIG2_Msk                  /*!< RNG configuration 2 */
#define RNG_CR_CLKDIV_Pos                   (16UL)
#define RNG_CR_CLKDIV_Msk                   (0xFUL << RNG_CR_CLKDIV_Pos)            /*!< 0x000F0000 */
#define RNG_CR_CLKDIV                       RNG_CR_CLKDIV_Msk                       /*!< Clock divider factor */
#define RNG_CR_CLKDIV_0                     (0x1UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00010000 */
#define RNG_CR_CLKDIV_1                     (0x2UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00020000 */
#define RNG_CR_CLKDIV_2                     (0x4UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00040000 */
#define RNG_CR_CLKDIV_3                     (0x8UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00080000 */
#define RNG_CR_RNG_CONFIG1_Pos              (20UL)
#define RNG_CR_RNG_CONFIG1_Msk              (0xFFUL << RNG_CR_RNG_CONFIG1_Pos)      /*!< 0x0FF00000 */
#define RNG_CR_RNG_CONFIG1                  RNG_CR_RNG_CONFIG1_Msk                  /*!< RNG configuration 1 */
#define RNG_CR_CONDRST_Pos                  (30UL)
#define RNG_CR_CONDRST_Msk                  (0x1UL << RNG_CR_CONDRST_Pos)           /*!< 0x40000000 */
#define RNG_CR_CONDRST                      RNG_CR_CONDRST_Msk                      /*!< Conditioning soft reset */
#define RNG_CR_CONFIGLOCK_Pos               (31UL)
#define RNG_CR_CONFIGLOCK_Msk               (0x1UL << RNG_CR_CONFIGLOCK_Pos)        /*!< 0x80000000 */
#define RNG_CR_CONFIGLOCK                   RNG_CR_CONFIGLOCK_Msk                   /*!< RNG configuration lock */

